#### OpenTofu Format and Style 🖌`success`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```

tofu
module.alb.data.aws_partition.current: Reading...
module.s3_bucket_alb_logs.data.aws_caller_identity.current: Reading...
module.s3_bucket_alb_logs.data.aws_partition.current: Reading...
module.s3_bucket_alb_logs.data.aws_region.current: Reading...
module.s3_bucket_alb_logs.data.aws_canonical_user_id.this[0]: Reading...
data.aws_route53_delegation_set.devops_xd1: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-005bbe3919cf5a3c0]
module.acm.aws_acm_certificate.this[0]: Refreshing state... [id=arn:aws:acm:us-east-2:211125613635:certificate/f4a67e96-5182-4acc-b989-2dedd1fe6118]
module.s3_bucket_alb_logs.aws_s3_bucket.this[0]: Refreshing state... [id=gchamon-alb-logs]
module.s3_bucket_alb_logs.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.s3_bucket_alb_logs.data.aws_partition.current: Read complete after 0s [id=aws]
module.alb.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_bucket_alb_logs.data.aws_caller_identity.current: Read complete after 0s [id=211125613635]
module.s3_bucket_alb_logs.data.aws_canonical_user_id.this[0]: Read complete after 0s [id=548d3778ed49d23b488f94d88aa426ec4b29256d9b24caa4462875b57ebdb348]
data.aws_route53_delegation_set.devops_xd1: Read complete after 0s [id=N02864853JHAFI5E7GEFS]
aws_route53_zone.devops_xd1: Refreshing state... [id=Z071787036MG7AHEDTTFW]
module.acm.aws_route53_record.validation[0]: Refreshing state... [id=Z071787036MG7AHEDTTFW__836588e23a04cb21c4e66c4322bbdebd.devops.xd1.dev._CNAME]
module.acm.aws_acm_certificate_validation.this[0]: Refreshing state... [id=2024-02-18 22:06:14.613 +0000 UTC]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-07a13bc483a55cfa8]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-03e247d25bb6a7569]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04005bf3c93a673ad]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0ba332d07edaab6b3]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0be21ad9c09b3b947]
module.alb.aws_security_group.this[0]: Refreshing state... [id=sg-0564fc74148e5a160]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-00f2a2b92e2b700dd]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b9146f6fc4f777f6]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0daf017bbd1829f8a]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0a1709659717a0431]
module.vpc.aws_vpn_gateway.this[0]: Refreshing state... [id=vgw-0a59016241da88280]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-018dae46511c55619]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-08c9212d6d822dfc1]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0b2be3b389a7b7415]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0c9c51bd590e2ffb6]
module.s3_bucket_alb_logs.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=gchamon-alb-logs]
module.alb.aws_vpc_security_group_egress_rule.this["all"]: Refreshing state... [id=sgr-072219a977b014e77]
module.alb.aws_vpc_security_group_ingress_rule.this["all_http"]: Refreshing state... [id=sgr-0f237b441dad0dfce]
module.alb.aws_vpc_security_group_ingress_rule.this["all_https"]: Refreshing state... [id=sgr-03dba6d21eb62fa2d]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0bdda5ff5502f8124]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0c885a0741dac87b7]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0a1709659717a04311080289494]
module.s3_bucket_alb_logs.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=gchamon-alb-logs]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:211125613635:loadbalancer/app/my-alb/4aa846291d8d28bf]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-06dbdc018e40d1c76]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-00fa4780b228630c7]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0ba1f71c09acd67b9]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0eed2d5cafa1ba907]
module.s3_bucket_alb_logs.aws_s3_bucket_acl.this[0]: Refreshing state... [id=gchamon-alb-logs,private]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0ba332d07edaab6b31080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0be21ad9c09b3b9471080289494]

Note: Objects have changed outside of OpenTofu

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.alb.aws_lb.this[0] has changed
  ~ resource "aws_lb" "this" {
      + arn                                         = "arn:aws:elasticloadbalancing:us-east-2:211125613635:loadbalancer/app/my-alb/4aa846291d8d28bf"
      + arn_suffix                                  = "app/my-alb/4aa846291d8d28bf"
      + dns_name                                    = "my-alb-2099733786.us-east-2.elb.amazonaws.com"
        id                                          = "arn:aws:elasticloadbalancing:us-east-2:211125613635:loadbalancer/app/my-alb/4aa846291d8d28bf"
        name                                        = "my-alb"
        tags                                        = {
            "terraform-aws-modules" = "alb"
        }
      + zone_id                                     = "Z3AADJGX6KTTL2"
        # (14 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

OpenTofu will perform the following actions:

  # module.alb.aws_lb.this[0] is tainted, so it must be replaced
-/+ resource "aws_lb" "this" {
      ~ arn                                                          = "arn:aws:elasticloadbalancing:us-east-2:211125613635:loadbalancer/app/my-alb/4aa846291d8d28bf" -> (known after apply)
      ~ arn_suffix                                                   = "app/my-alb/4aa846291d8d28bf" -> (known after apply)
      ~ dns_name                                                     = "my-alb-2099733786.us-east-2.elb.amazonaws.com" -> (known after apply)
      ~ drop_invalid_header_fields                                   = false -> true
      - enable_cross_zone_load_balancing                             = true -> null
      ~ enable_deletion_protection                                   = false -> true
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      ~ id                                                           = "arn:aws:elasticloadbalancing:us-east-2:211125613635:loadbalancer/app/my-alb/4aa846291d8d28bf" -> (known after apply)
      ~ internal                                                     = false -> (known after apply)
      ~ ip_address_type                                              = "ipv4" -> (known after apply)
        name                                                         = "my-alb"
      + name_prefix                                                  = (known after apply)
        tags                                                         = {
            "terraform-aws-modules" = "alb"
        }
      ~ vpc_id                                                       = "vpc-005bbe3919cf5a3c0" -> (known after apply)
      ~ zone_id                                                      = "Z3AADJGX6KTTL2" -> (known after apply)
        # (12 unchanged attributes hidden)

      ~ access_logs {
          + bucket  = (known after apply)
          ~ enabled = false -> true
        }

      - connection_logs {
          - enabled = false -> null
        }

      - subnet_mapping {
          - subnet_id = "subnet-0b9146f6fc4f777f6" -> null
        }
      - subnet_mapping {
          - subnet_id = "subnet-0daf017bbd1829f8a" -> null
        }

        # (1 unchanged block hidden)
    }

  # module.alb.aws_lb_listener.this["http-https-redirect"] will be created
  + resource "aws_lb_listener" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "terraform-aws-modules" = "alb"
        }
      + tags_all          = {
          + "terraform-aws-modules" = "alb"
        }

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # module.alb.aws_lb_listener.this["https"] will be created
  + resource "aws_lb_listener" "this" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:us-east-2:211125613635:certificate/f4a67e96-5182-4acc-b989-2dedd1fe6118"
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-TLS13-1-2-Res-2021-06"
      + tags              = {
          + "terraform-aws-modules" = "alb"
        }
      + tags_all          = {
          + "terraform-aws-modules" = "alb"
        }

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "not found"
              + status_code  = "404"
            }
        }
    }

  # module.s3_bucket_alb_logs.data.aws_iam_policy_document.combined[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.s3_bucket_alb_logs.data.aws_iam_policy_document.elb_log_delivery[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "elb_log_delivery" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::gchamon-alb-logs/*",
            ]
          + sid       = "ELBRegionUs-East-2"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::033677994240:root",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::gchamon-alb-logs/*",
            ]

          + principals {
              + identifiers = [
                  + "logdelivery.elasticloadbalancing.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.s3_bucket_alb_logs.aws_s3_bucket.this[0] will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
      ~ force_destroy               = false -> true
        id                          = "gchamon-alb-logs"
        tags                        = {}
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.s3_bucket_alb_logs.aws_s3_bucket_acl.this[0] will be updated in-place
  ~ resource "aws_s3_bucket_acl" "this" {
      ~ acl    = "private" -> "log-delivery-write"
        id     = "gchamon-alb-logs,private"
        # (1 unchanged attribute hidden)

      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id   = "548d3778ed49d23b488f94d88aa426ec4b29256d9b24caa4462875b57ebdb348" -> null
                  - type = "CanonicalUser" -> null
                }
            }
          - owner {
              - id = "548d3778ed49d23b488f94d88aa426ec4b29256d9b24caa4462875b57ebdb348" -> null
            }
        }
    }

  # module.s3_bucket_alb_logs.aws_s3_bucket_ownership_controls.this[0] must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "this" {
      ~ bucket = "gchamon-alb-logs" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "gchamon-alb-logs" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.s3_bucket_alb_logs.aws_s3_bucket_policy.this[0] will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = "gchamon-alb-logs"
      + id     = (known after apply)
      + policy = (known after apply)
    }

Plan: 5 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

*Pusher: @gchamon, Action: `pull_request`, Working Directory: ``, Workflow: `OpenTofu Check`*